docs/research/2026-03-16_QUANTUM_MODELS_SOCIAL_ECONOMIC.tex
% Created 2026-03-16 Mon 17:28
% Intended LaTeX compiler: lualatex
\documentclass[11pt]{article}
\usepackage{amsmath}
\usepackage{fontspec}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Prologos Project}
\date{2026-03-16}
\title{Quantum-Like Models for Social, Economic, and Cognitive Systems\\\medskip
\large A Research Background for Tensor-Aware Propagator Networks in Prologos}
\hypersetup{
 pdfauthor={Prologos Project},
 pdftitle={Quantum-Like Models for Social, Economic, and Cognitive Systems},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.39)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{1. Introduction}
\label{sec:org1f81317}

\subsection{1.1 The Quantum Probability Revolution in Social Science}
\label{sec:org676a9dc}

Over the past three decades, a growing community of researchers has discovered
that the mathematical formalism of quantum mechanics --- Hilbert spaces,
superposition, interference, entanglement, and projective measurement --- provides
a more natural framework than classical (Kolmogorovian) probability for modeling
human decision-making, cognition, social dynamics, and economic behavior. This is
not a claim about quantum physics in the brain. It is a claim about mathematics:
quantum probability theory is the \emph{next-simplest} probability theory after
classical probability, and it naturally accommodates phenomena --- contextuality,
order effects, interference --- that classical probability cannot represent.

The field has reached institutional maturity. A dedicated journal, \emph{Quantum
Economics and Finance} (SAGE, in collaboration with the Center for Quantum Social
and Cognitive Science), publishes peer-reviewed research. Special issues in
\emph{Quantum Reports} (MDPI), \emph{Frontiers in Physics}, and \emph{Topics in Cognitive
Science} have collected major contributions. Comprehensive references include
Busemeyer \& Bruza's \emph{Quantum Models of Cognition and Decision} (2012), Haven \&
Khrennikov's \emph{Quantum Social Science} (2013), and the \emph{Palgrave Handbook of
Quantum Models in Social Science}. A 2026 systematic review (Jammal et al.)
documents steady publication growth, with over 60 articles in 2024 alone.
\subsection{1.2 Why Hilbert Space?}
\label{sec:org1768d98}

Classical probability (Kolmogorov, 1933) assigns probabilities to events as
elements of a Boolean algebra. The key properties: probabilities are real and
non-negative; they add for disjoint events; the total is 1. This framework
assumes:
\begin{itemize}
\item \textbf{Commutativity:} P(A and B) = P(B and A).
\item \textbf{The law of total probability:} P(A) = P(A|B)P(B) + P(A|¬B)P(¬B).
\item \textbf{Single sample space:} All events can be jointly represented.
\end{itemize}

Human cognition and social behavior routinely violate all three. The order in
which questions are asked changes the answers (non-commutativity). The disjunction
effect violates the law of total probability. Preferences cannot always be
represented in a single consistent framework (contextuality).

Quantum probability (von Neumann, 1932) replaces the Boolean algebra with a
Hilbert space. Events are subspaces; probabilities are squared magnitudes of
projections. This framework accommodates:
\begin{itemize}
\item \textbf{Non-commutativity:} Projecting onto subspace A then B differs from B then A.
\item \textbf{Interference:} |a+b|² ≠ |a|² + |b|² when cross-terms are nonzero.
\item \textbf{Contextuality:} Different measurement contexts yield incompatible probability
spaces.
\end{itemize}

The crucial point: these are \emph{mathematical} properties of Hilbert spaces, not
\emph{physical} properties of quantum mechanics. Any system exhibiting contextuality,
order effects, or interference --- whether it is a photon, a human decision-maker,
or a financial market --- is more naturally described by quantum probability than
by classical probability.
