docs/research/2026-03-16_QUANTUM_MODELS_SOCIAL_ECONOMIC.tex
\subsection{1.3 Historical Overview}
\label{sec:org9753fb5}

The idea of applying quantum formalism to cognition emerged independently from
several sources in the 1990s:

\begin{itemize}
\item \textbf{Aerts and collaborators} (Brussels) developed a quantum-like model of concept
combination, showing that the "pet-fish" problem (a guppy is a good example of
"pet fish" but a poor example of either "pet" or "fish") requires a state space
richer than classical probability.
\item \textbf{Khrennikov} (Linnaeus University) developed a contextual probability framework,
pointing out that violations of the formula of total probability can serve as
a quantitative measure of non-classicality.
\item \textbf{Bordley} applied quantum probability to decision-making, showing that
interference effects explain preference reversals.
\end{itemize}

The field accelerated in the 2000s with:
\begin{itemize}
\item \textbf{Busemeyer and collaborators} (Indiana University) developing formal quantum
models of specific cognitive phenomena: the conjunction fallacy, the disjunction
effect, order effects in judgments.
\item \textbf{Haven and Khrennikov} connecting quantum formalism to financial markets and
economics.
\item \textbf{Yukalov and Sornette} (ETH Zurich) developing Quantum Decision Theory as a
comprehensive mathematical framework.
\end{itemize}

The 2010s saw consolidation into textbooks and institutional infrastructure.
The 2020s have brought empirical validation at scale (the QQ equality tested on
70+ national surveys), practical applications (quantum computing for portfolio
optimization), and new theoretical developments (quantum-like Bayesian networks,
open quantum systems for cognitive dynamics).
\subsection{1.4 Connection to Prologos}
\label{sec:orgd574b2f}

A companion document ("Tensor-Aware Propagator Networks with Unitary Evolution")
describes how Prologos's propagator network can be extended with TensorCells
(joint amplitude distributions over multiple variables) and unitary evolution
(reversible transformations of quantum-like states). This background document
provides the domain knowledge for what such a system could model.

The connection is direct: every quantum-like model in the literature requires
(1) a state space (Hilbert space), (2) evolution operators (unitaries), and
(3) measurement (projection + Born rule). In Prologos, these map to
(1) TensorCells, (2) unitary propagators, and (3) the measurement stratum with
ATMS integration. The dependent type system provides compile-time dimensional
correctness; the propagator network provides the computational engine; the
Layered Recovery Principle ensures that unitary evolution and measurement are
correctly stratified.
\section{2. Foundations: Quantum Probability vs. Classical Probability}
\label{sec:org49de79e}

\subsection{2.1 Kolmogorov Probability and Its Limitations}
\label{sec:org6f10e76}

Classical probability theory (Kolmogorov, 1933) rests on a probability space
(Ω, F, P) where Ω is a sample space, F is a σ-algebra of events, and P is a
probability measure. For finite spaces, this reduces to:
\begin{itemize}
\item A set of outcomes \{ω₁, \ldots{}, ωₙ\}.
\item Probabilities p(ωᵢ) ≥ 0 with Σᵢ p(ωᵢ) = 1.
\item P(A) = Σ\textsubscript{ωᵢ∈A} p(ωᵢ) for any event A ⊆ Ω.
\end{itemize}

The law of total probability follows: P(A) = P(A|B)P(B) + P(A|B\textsuperscript{c})P(B\textsuperscript{c}),
expressing P(A) as a weighted sum over a partition. This is the foundation of
Bayesian reasoning.

\textbf{Limitations in cognitive science:}

The law of total probability is empirically violated in human judgment.
Tversky and Shafir (1992) demonstrated the \textbf{disjunction effect}: in a
two-stage gamble, participants who knew they won the first stage chose to play
again (67\%); participants who knew they lost also chose to play again (59\%);
but participants who did \emph{not} know the outcome of the first stage chose to play
again at a lower rate (36\%). Under classical probability, not knowing the
outcome should produce a probability between 59\% and 67\%, not below both.
This is a direct violation of the law of total probability.
\subsection{2.2 Hilbert Space Probability}
\label{sec:org77c741b}

Quantum probability replaces the classical framework with:
\begin{itemize}
\item A Hilbert space H (a complex vector space with inner product).
\item A state |ψ⟩ ∈ H with ||ψ|| = 1 (a unit vector).
\item Observables as projection operators P\textsubscript{A} (self-adjoint, P² = P).
\item Probability of event A: p(A) = ||P\textsubscript{A}|ψ⟩||² = ⟨ψ|P\textsubscript{A}|ψ⟩.
\item State update after observing A: |ψ'⟩ = P\textsubscript{A}|ψ⟩ / ||P\textsubscript{A}|ψ⟩|| (Lüders' rule).
\end{itemize}

\textbf{Key differences from classical probability:}

\begin{enumerate}
\item \textbf{Non-commutativity.} If P\textsubscript{A} P\textsubscript{B} ≠ P\textsubscript{B} P\textsubscript{A}, then the probability of "A then B"
differs from "B then A":
p(A then B) = ||P\textsubscript{B} P\textsubscript{A}|ψ⟩||² ≠ ||P\textsubscript{A} P\textsubscript{B}|ψ⟩||² = p(B then A).
This models order effects in survey questions.

\item \textbf{Interference.} If |ψ⟩ = α|a⟩ + β|b⟩, then:
p(c) = |⟨c|ψ⟩|² = |α⟨c|a⟩ + β⟨c|b⟩|²
     = |α|²|⟨c|a⟩|² + |β|²|⟨c|b⟩|² + 2Re(α*β⟨c|a⟩*⟨c|b⟩)
The last term is the \emph{interference term}, absent in classical probability.

\item \textbf{Incompatibility.} Two observables A, B are incompatible if their projection
operators do not commute. Measuring A disturbs the state with respect to B.
There is no joint probability distribution for incompatible observables.
\end{enumerate}
