docs/research/2026-03-16_QUANTUM_MODELS_SOCIAL_ECONOMIC.tex
\subsection{2.3 Interference and Superposition}
\label{sec:org8ebe4f4}

The interference term is the key mechanism by which quantum-like models produce
non-classical predictions. Consider a decision between options C (cooperate) and
D (defect):

\begin{itemize}
\item Classical: p(C) = p(C|know\textsubscript{win})p(know\textsubscript{win}) + p(C|know\textsubscript{lose})p(know\textsubscript{lose})
= 0.67 × 0.5 + 0.59 × 0.5 = 0.63.
\item Quantum: |ψ⟩ = α|win⟩ + β|lose⟩. After interference:
p(C) = |α|²p(C|win) + |β|²p(C|lose) + 2Re(α*β × interference)
The interference term can be \emph{negative}, reducing p(C) below both conditional
probabilities. This explains the disjunction effect.
\end{itemize}

The double-slit analogy is useful: when a particle passes through two slits
simultaneously (superposition), the probability pattern at the detector shows
interference fringes. When a decision-maker considers two possible states of
the world simultaneously (uncertainty), the choice probability shows
"interference fringes" --- deviations from the weighted average of the
conditional probabilities.
\subsection{2.4 Entanglement and Non-Separability}
\label{sec:org35b767f}

Two systems A and B are \textbf{entangled} when their joint state cannot be factored:
\begin{center}
\begin{tabular}{lllll}
ψ\textsubscript{AB}⟩ ≠ & ψ\textsubscript{A}⟩ ⊗ & ψ\textsubscript{B}⟩ for any states & ψ\textsubscript{A}⟩, & ψ\textsubscript{B}⟩.\\
\end{tabular}
\end{center}

The Bell state (|00⟩ + |11⟩)/√2 is the canonical example: if A is measured and
found to be 0, then B is guaranteed to be 0 as well, even though neither had a
definite value before measurement. The correlations are stronger than any
classical probabilistic model can produce (Bell's theorem).

In social science, entanglement models non-separable preferences and correlated
beliefs:
\begin{itemize}
\item \textbf{Voter preferences:} A voter's preference for president and senator cannot always
be factored into independent presidential and senatorial preferences. "Ticket
splitting" (different parties for different races) may violate classical
separability.
\item \textbf{Agent interactions:} Two traders whose strategies are correlated through shared
information or social influence may have entangled strategy states.
\item \textbf{Concept combination:} The concept "pet fish" (well-modeled by a guppy) cannot
be derived from independent concepts "pet" (well-modeled by a dog) and "fish"
(well-modeled by a trout). Aerts showed this requires entangled concept states.
\end{itemize}
\subsection{2.5 Open Quantum Systems and Decoherence}
\label{sec:orgf5dba0c}

Real quantum systems interact with their environments, causing decoherence --- the
loss of quantum coherence (interference capability). The GKSL (Gorini-Kossakowski-
Sudarshan-Lindblad) master equation governs this evolution:

\begin{verbatim}
dρ/dt = -i[H, ρ] + Σ_k (L_k ρ L_k† - ½{L_k†L_k, ρ})
\end{verbatim}

where ρ is the density matrix (mixed state), H is the Hamiltonian (unitary
dynamics), and L\textsubscript{k} are Lindblad operators (environmental interaction). The first
term drives unitary evolution (rotation); the second term drives decoherence
(decay of off-diagonal elements).

In cognitive modeling (Asano, Khrennikov et al.), this models decision-making:
\begin{itemize}
\item The initial state ρ₀ is a superposition of choices (indecision).
\item The Hamiltonian H encodes the decision-maker's preferences and information.
\item The Lindblad operators L\textsubscript{k} model interaction with the "mental environment"
(memory, emotions, social pressure).
\item The stationary state ρ\_∞ is the final decision --- a classical mixture
(diagonal density matrix) with no remaining quantum coherence.
\end{itemize}

The \textbf{diffidence} (classical entropy minus quantum entropy) tracks the decision
process: it starts high (quantum uncertainty exceeds classical) and decays to zero
as decoherence eliminates quantum effects, leaving a classical choice.
\subsection{2.6 Contextuality}
\label{sec:orgf099a5b}

\textbf{Contextuality} is the property that the outcome of a measurement depends on what
other measurements are performed alongside it. In classical probability, outcomes
are context-independent: the probability of "heads" on a coin does not depend on
whether a die is also rolled. In quantum mechanics, the probability of a spin
measurement outcome depends on which axis is measured simultaneously.

Dzhafarov and Kujala developed the \textbf{Contextuality-by-Default (CbD)} framework,
which extends contextuality analysis to "inconsistently connected" systems --- those
where marginal distributions change across contexts (a common feature of behavioral
data). The CbD framework distinguishes between:
\begin{itemize}
\item \textbf{Direct influences:} Changes in marginal distributions due to context changes.
\item \textbf{True contextuality:} Correlations that cannot be explained by any classical
coupling, even after accounting for direct influences.
\end{itemize}

The "Snow Queen" experiment (Cervantes \& Dzhafarov) provided the first
unequivocal empirical evidence of true contextuality in human behavior. A 2025
study found true contextuality in global investment decisions, demonstrating that
the phenomenon extends beyond laboratory settings to real-world economic behavior.
\section{3. Quantum Decision Theory}
\label{sec:org7b8b33c}
