docs/research/2026-03-16_QUANTUM_MODELS_SOCIAL_ECONOMIC.md


<a id="orgbc2e9e6"></a>

## 2.3 Interference and Superposition

The interference term is the key mechanism by which quantum-like models produce non-classical predictions. Consider a decision between options C (cooperate) and D (defect):

-   Classical: p(C) = p(C|know<sub>win</sub>)p(know<sub>win</sub>) + p(C|know<sub>lose</sub>)p(know<sub>lose</sub>) = 0.67 × 0.5 + 0.59 × 0.5 = 0.63.
-   Quantum: |ψ⟩ = α|win⟩ + β|lose⟩. After interference: p(C) = |α|²p(C|win) + |β|²p(C|lose) + 2Re(α\*β × interference) The interference term can be *negative*, reducing p(C) below both conditional probabilities. This explains the disjunction effect.

The double-slit analogy is useful: when a particle passes through two slits simultaneously (superposition), the probability pattern at the detector shows interference fringes. When a decision-maker considers two possible states of the world simultaneously (uncertainty), the choice probability shows "interference fringes" &#x2014; deviations from the weighted average of the conditional probabilities.


<a id="orgb6fa4d5"></a>

## 2.4 Entanglement and Non-Separability

Two systems A and B are **entangled** when their joint state cannot be factored:

|                  |                 |                              |                |                |
|----------------- |---------------- |----------------------------- |--------------- |--------------- |
| ψ<sub>AB</sub>⟩ ≠ | ψ<sub>A</sub>⟩ ⊗ | ψ<sub>B</sub>⟩ for any states | ψ<sub>A</sub>⟩, | ψ<sub>B</sub>⟩. |

The Bell state (|00⟩ + |11⟩)/√2 is the canonical example: if A is measured and found to be 0, then B is guaranteed to be 0 as well, even though neither had a definite value before measurement. The correlations are stronger than any classical probabilistic model can produce (Bell's theorem).

In social science, entanglement models non-separable preferences and correlated beliefs:

-   **Voter preferences:** A voter's preference for president and senator cannot always be factored into independent presidential and senatorial preferences. "Ticket splitting" (different parties for different races) may violate classical separability.
-   **Agent interactions:** Two traders whose strategies are correlated through shared information or social influence may have entangled strategy states.
-   **Concept combination:** The concept "pet fish" (well-modeled by a guppy) cannot be derived from independent concepts "pet" (well-modeled by a dog) and "fish" (well-modeled by a trout). Aerts showed this requires entangled concept states.


<a id="orgb5273af"></a>

## 2.5 Open Quantum Systems and Decoherence

Real quantum systems interact with their environments, causing decoherence &#x2014; the loss of quantum coherence (interference capability). The GKSL (Gorini-Kossakowski- Sudarshan-Lindblad) master equation governs this evolution:

```
dρ/dt = -i[H, ρ] + Σ_k (L_k ρ L_k† - ½{L_k†L_k, ρ})
```

where ρ is the density matrix (mixed state), H is the Hamiltonian (unitary dynamics), and L<sub>k</sub> are Lindblad operators (environmental interaction). The first term drives unitary evolution (rotation); the second term drives decoherence (decay of off-diagonal elements).

In cognitive modeling (Asano, Khrennikov et al.), this models decision-making:

-   The initial state ρ₀ is a superposition of choices (indecision).
-   The Hamiltonian H encodes the decision-maker's preferences and information.
-   The Lindblad operators L<sub>k</sub> model interaction with the "mental environment" (memory, emotions, social pressure).
-   The stationary state ρ\_∞ is the final decision &#x2014; a classical mixture (diagonal density matrix) with no remaining quantum coherence.

The **diffidence** (classical entropy minus quantum entropy) tracks the decision process: it starts high (quantum uncertainty exceeds classical) and decays to zero as decoherence eliminates quantum effects, leaving a classical choice.


<a id="org5fd8cfa"></a>

## 2.6 Contextuality

**Contextuality** is the property that the outcome of a measurement depends on what other measurements are performed alongside it. In classical probability, outcomes are context-independent: the probability of "heads" on a coin does not depend on whether a die is also rolled. In quantum mechanics, the probability of a spin measurement outcome depends on which axis is measured simultaneously.

Dzhafarov and Kujala developed the **Contextuality-by-Default (CbD)** framework, which extends contextuality analysis to "inconsistently connected" systems &#x2014; those where marginal distributions change across contexts (a common feature of behavioral data). The CbD framework distinguishes between:

-   **Direct influences:** Changes in marginal distributions due to context changes.
-   **True contextuality:** Correlations that cannot be explained by any classical coupling, even after accounting for direct influences.

The "Snow Queen" experiment (Cervantes & Dzhafarov) provided the first unequivocal empirical evidence of true contextuality in human behavior. A 2025 study found true contextuality in global investment decisions, demonstrating that the phenomenon extends beyond laboratory settings to real-world economic behavior.


<a id="org4d19be0"></a>

# 3. Quantum Decision Theory
