docs/research/2026-03-16_QUANTUM_MODELS_SOCIAL_ECONOMIC.tex

\subsection{3.1 The Yukalov-Sornette Framework}
\label{sec:org7de854a}

Quantum Decision Theory (QDT), developed by Vyacheslav Yukalov and Didier Sornette
(ETH Zurich), is a comprehensive mathematical framework that decomposes behavioral
probability into classical and quantum components.

\textbf{Mathematical formulation.} The probability of choosing a prospect πⱼ is:

\begin{verbatim}
p(πⱼ) = f(πⱼ) + q(πⱼ)
\end{verbatim}

where:
\begin{itemize}
\item f(πⱼ) is the \textbf{utility factor} --- the classical probability derived from
expected utility or other rational choice models. It satisfies all classical
probability axioms: f(πⱼ) ≥ 0, Σⱼ f(πⱼ) = 1.
\item q(πⱼ) is the \textbf{attraction factor} --- the quantum interference term capturing
emotional, irrational, and bias-driven components. It satisfies Σⱼ q(πⱼ) = 0
(the interference terms sum to zero, preserving total probability).
\end{itemize}

The attraction factor arises from the entanglement between the decision-maker's
strategic state and the prospects being evaluated. When prospects are composite
(involving multiple attributes or stages), the probability operator decomposes
into products of sub-operators, and cross-terms appear due to entanglement.

\textbf{The Quarter Law.} QDT predicts that the average magnitude of the attraction factor
is:

\begin{verbatim}
⟨|q|⟩ = 1/4
\end{verbatim}

This is not merely an empirical finding but is derivable as the non-informative
prior over several families of distributions (uniform, beta, Gaussian). The
Quarter Law provides a parameter-free quantitative prediction: the quantum
deviation from classical expected utility averages 25\% of the choice probability.

\textbf{Empirical validation.} The Quarter Law has been tested on simple risky choices
(lottery pairs) and group-level data strongly support it (Yukalov \& Sornette, 2016).
\subsection{3.2 Classical Decision Paradoxes Resolved}
\label{sec:org0278a82}

QDT resolves the major anomalies of classical decision theory as natural
consequences of quantum interference:

\textbf{Allais paradox.} People prefer a certain \$1M to an 89\% chance of \$1M + 10\%
chance of \$5M + 1\% chance of \$0, yet simultaneously prefer a 10\% chance of \$5M
to an 11\% chance of \$1M. This violates expected utility's independence axiom.
In QDT, the interference term is positive for the certain option (reinforcing
certainty preference) and negative for the mixed gamble (suppressing risk
tolerance), producing the observed pattern.

\textbf{Ellsberg paradox.} People prefer betting on a known 50-50 urn to an urn with
unknown composition, even when the expected values are identical. Classical
probability requires ambiguity-neutral behavior. In QDT, ambiguity generates
a negative attraction factor (ambiguity aversion), reducing the probability
of choosing the ambiguous option below its utility factor.

\textbf{Disjunction effect.} As described in §2.1: knowing the outcome of a first stage
leads to playing again regardless, but not knowing leads to refusing. The
interference between the "won" and "lost" branches is destructive,
reducing the play-again probability below both conditional probabilities.

\textbf{Conjunction fallacy.} People judge P(feminist ∧ bank teller) > P(bank teller),
violating the conjunction rule. In QDT, the conjunction is not a classical
intersection but a sequential projection. The "feminist" projection rotates
the state into a subspace where "bank teller" has higher probability than
it does from the initial state.
\subsection{3.3 Quantum Prospect Theory}
\label{sec:org6e88037}

Quantum Prospect Theory augments Kahneman and Tversky's Cumulative Prospect
Theory (CPT) with quantum interference effects. The key formula adds an
interference term to the CPT value function:

\begin{verbatim}
V_quantum(prospect) = V_CPT(prospect) + interference(prospect)
\end{verbatim}

The interference term captures conflicting interests, ambiguity, and emotions
arising during deliberation. Two estimation methods exist:
\begin{itemize}
\item The \textbf{interference alternation method}: estimates the sign and magnitude of
interference from the structure of the prospect.
\item The \textbf{interference quarter law}: uses the QDT quarter law as a default
magnitude.
\end{itemize}

Empirical comparisons show that at the aggregate level, CPT-based QDT outperforms
pure CPT. At the individual level, RDU-based (Rank-Dependent Utility) QDT best
captures heterogeneity across subjects.
