docs/research/2026-03-16_QUANTUM_MODELS_SOCIAL_ECONOMIC.md


<a id="org7450375"></a>

## 3.1 The Yukalov-Sornette Framework

Quantum Decision Theory (QDT), developed by Vyacheslav Yukalov and Didier Sornette (ETH Zurich), is a comprehensive mathematical framework that decomposes behavioral probability into classical and quantum components.

**Mathematical formulation.** The probability of choosing a prospect πⱼ is:

```
p(πⱼ) = f(πⱼ) + q(πⱼ)
```

where:

-   f(πⱼ) is the **utility factor** &#x2014; the classical probability derived from expected utility or other rational choice models. It satisfies all classical probability axioms: f(πⱼ) ≥ 0, Σⱼ f(πⱼ) = 1.
-   q(πⱼ) is the **attraction factor** &#x2014; the quantum interference term capturing emotional, irrational, and bias-driven components. It satisfies Σⱼ q(πⱼ) = 0 (the interference terms sum to zero, preserving total probability).

The attraction factor arises from the entanglement between the decision-maker's strategic state and the prospects being evaluated. When prospects are composite (involving multiple attributes or stages), the probability operator decomposes into products of sub-operators, and cross-terms appear due to entanglement.

**The Quarter Law.** QDT predicts that the average magnitude of the attraction factor is:

```
⟨|q|⟩ = 1/4
```

This is not merely an empirical finding but is derivable as the non-informative prior over several families of distributions (uniform, beta, Gaussian). The Quarter Law provides a parameter-free quantitative prediction: the quantum deviation from classical expected utility averages 25% of the choice probability.

**Empirical validation.** The Quarter Law has been tested on simple risky choices (lottery pairs) and group-level data strongly support it (Yukalov & Sornette, 2016).


<a id="org0f919e2"></a>

## 3.2 Classical Decision Paradoxes Resolved

QDT resolves the major anomalies of classical decision theory as natural consequences of quantum interference:

**Allais paradox.** People prefer a certain $1M to an 89% chance of $1M + 10% chance of $5M + 1% chance of $0, yet simultaneously prefer a 10% chance of $5M to an 11% chance of $1M. This violates expected utility's independence axiom. In QDT, the interference term is positive for the certain option (reinforcing certainty preference) and negative for the mixed gamble (suppressing risk tolerance), producing the observed pattern.

**Ellsberg paradox.** People prefer betting on a known 50-50 urn to an urn with unknown composition, even when the expected values are identical. Classical probability requires ambiguity-neutral behavior. In QDT, ambiguity generates a negative attraction factor (ambiguity aversion), reducing the probability of choosing the ambiguous option below its utility factor.

**Disjunction effect.** As described in §2.1: knowing the outcome of a first stage leads to playing again regardless, but not knowing leads to refusing. The interference between the "won" and "lost" branches is destructive, reducing the play-again probability below both conditional probabilities.

**Conjunction fallacy.** People judge P(feminist ∧ bank teller) > P(bank teller), violating the conjunction rule. In QDT, the conjunction is not a classical intersection but a sequential projection. The "feminist" projection rotates the state into a subspace where "bank teller" has higher probability than it does from the initial state.


<a id="orge31863d"></a>

## 3.3 Quantum Prospect Theory

Quantum Prospect Theory augments Kahneman and Tversky's Cumulative Prospect Theory (CPT) with quantum interference effects. The key formula adds an interference term to the CPT value function:

```
V_quantum(prospect) = V_CPT(prospect) + interference(prospect)
```

The interference term captures conflicting interests, ambiguity, and emotions arising during deliberation. Two estimation methods exist:

-   The **interference alternation method**: estimates the sign and magnitude of interference from the structure of the prospect.
-   The **interference quarter law**: uses the QDT quarter law as a default magnitude.

Empirical comparisons show that at the aggregate level, CPT-based QDT outperforms pure CPT. At the individual level, RDU-based (Rank-Dependent Utility) QDT best captures heterogeneity across subjects.
