docs/research/2026-03-16_QUANTUM_MODELS_SOCIAL_ECONOMIC.md


<a id="org398a0bd"></a>

## 3.4 Order Effects in Judgments

Wang and Busemeyer (2013) derived a parameter-free prediction from quantum probability: the **QQ equality**.

For two binary yes/no questions A and B:

```
p(Ay,By) + p(An,Bn) - p(By,Ay) - p(Bn,An) = 0
```

where p(Ay,By) is the probability of answering "yes" to A and then "yes" to B.

**Derivation.** The QQ equality follows from the law of reciprocity for Hilbert space inner products: |⟨ψ<sub>B</sub>|ψ<sub>A</sub>⟩|² = |⟨ψ<sub>A</sub>|ψ<sub>B</sub>⟩|². The real part of the inner product is independent of projection order, yielding the equality.

**Empirical validation.** Wang et al. (2014) tested the QQ equality on **70 national representative surveys** (most with >1000 participants each, conducted by Gallup and Pew Research) plus two laboratory experiments. The QQ equality was strongly upheld &#x2014; a remarkable result given that it is a parameter-free, a priori prediction derived purely from the mathematical structure of Hilbert space.

Neither Bayesian models nor Markov models generally satisfy the QQ equality. Its empirical success is one of the strongest pieces of evidence for the quantum probability framework in cognitive science.


<a id="org5ae1a55"></a>

# 4. Quantum Cognition


<a id="orgc16869d"></a>

## 4.1 Similarity Judgments

The **Quantum Similarity Model** (QSM), developed by Pothos and Busemeyer, models concepts as subspaces of a Hilbert space (not as points, as in classical geometric models). The key innovation: similarity between two concepts is computed as the probability of a sequential projection.

**Formal structure:**

-   A concept C is associated with a subspace H<sub>C</sub> of the Hilbert space.
-   The mental state is a vector |ψ⟩.
-   Similarity of A to B is: sim(A,B) = ||P<sub>B</sub> P<sub>A</sub>|ψ⟩||² (project onto A, then B).

**Key advantages:**

-   **Asymmetry.** sim(A,B) ≠ sim(B,A) because P<sub>B</sub> P<sub>A</sub> ≠ P<sub>A</sub> P<sub>B</sub> in general. This captures Tversky's (1977) finding that similarity judgments are asymmetric: North Korea is more similar to China than China is to North Korea.
-   **Diagnosticity.** Context (prior projections) changes similarity judgments. After seeing several fruits, an apple is similar to an orange; after seeing several round objects, an apple is similar to a ball.
-   **Unification.** The QSM uses the same mathematical framework as the conjunction fallacy model, the order effects model, and the disjunction effect model. All are instances of projection in Hilbert space.


<a id="org3559244"></a>

## 4.2 Conceptual Combination

The conjunction fallacy (§3.2) is a special case of conceptual combination. More broadly, quantum models address the general problem of how concepts combine:

**The guppy problem.** A guppy is a good example of "pet fish" but a poor example of either "pet" or "fish." Classical fuzzy set theory (Osherson & Smith, 1981) predicts that membership in A∧B should be at most min(membership in A, membership in B). The guppy violates this: membership in "pet fish" exceeds membership in both components.

Aerts (2009) showed that this requires an *entangled* state in the tensor product of the "pet" and "fish" Hilbert spaces. The concept "pet fish" is not the intersection of "pet" and "fish" but a projection onto a subspace of the composite space that has no product-state representation.

**Overextension.** When combining concepts, people sometimes extend the category beyond what either component warrants. "Stone lion" is judged as a better predator than "stone" warrants and a better decorative object than "lion" warrants. This "emergence of new meaning" in conceptual conjunction maps to the quantum phenomenon of measurement outcomes that differ from what either subsystem alone would produce.


<a id="org7fcbd95"></a>

## 4.3 Memory and Perception

Quantum models have been applied to:

-   **Memory retrieval:** The order in which memory items are recalled affects subsequent retrieval probabilities, modeled as sequential projections.
-   **Perception:** Ambiguous stimuli (Necker cube, duck-rabbit) are modeled as superpositions that collapse upon "measurement" (conscious perception). The dynamics of perceptual switching are modeled by unitary evolution.
-   **Categorization:** Categorization decisions under uncertainty exhibit interference effects analogous to the disjunction effect.
