docs/research/2026-03-16_QUANTUM_MODELS_SOCIAL_ECONOMIC.tex
\subsection{4.4 Causal Reasoning}
\label{sec:org4b56273}

Trueblood and Busemeyer (2011, 2012) developed \textbf{quantum-like Bayesian networks}
(QLBNs) by replacing classical probabilities with quantum probability amplitudes.

\textbf{Framework:}
\begin{itemize}
\item Any classical Bayesian network can be generalized to a quantum Bayesian network
by replacing conditional probability tables with conditional amplitude tables.
\item A \textbf{similarity heuristic} automatically fits parameters through vector
similarities, addressing the exponential growth of quantum parameters.
\end{itemize}

\textbf{Key results:}
\begin{itemize}
\item QLBNs account for \textbf{order effects in causal judgments}: judging whether A causes
C and then whether B causes C gives different results than the reverse order.
Classical Bayesian networks, which satisfy the local Markov condition, cannot
produce order effects.
\item \textbf{Anti-discounting:} In classical causal reasoning, learning about an alternative
cause should reduce belief in the original cause (discounting). Humans sometimes
do the opposite (anti-discounting). QLBNs model this via constructive
interference between causal pathways.
\item \textbf{Reciprocity:} Observing that A causes B increases belief that B causes A, even
when there is no causal mechanism. This arises naturally from the symmetry of
Hilbert space inner products.
\end{itemize}
\subsection{4.5 The Open Systems Approach}
\label{sec:orga5b3af6}

Asano, Ohya, Tanaka, Basieva, and Khrennikov developed a comprehensive model
of cognitive dynamics using the GKSL master equation (§2.5).

\textbf{Core model:}
\begin{enumerate}
\item The decision-maker's mental state is a density matrix ρ on a Hilbert space
whose basis elements correspond to choices.
\item The Hamiltonian H encodes preferences and information dynamics.
\item Lindblad operators L\textsubscript{k} model interaction with the mental environment:
memory retrieval, emotional processing, social pressure.
\item The master equation dρ/dt = -i[H,ρ] + Σ\textsubscript{k}(L\textsubscript{k} ρ L\textsubscript{k}† - ½\{L\textsubscript{k}†L\textsubscript{k}, ρ\})
drives the mental state toward a stationary state ρ\_∞.
\item The stationary state is a classical mixture (diagonal) representing the
final decision.
\end{enumerate}

\textbf{Applications:}
\begin{itemize}
\item \textbf{Disjunction effect in Prisoner's Dilemma:} The Shafir-Tversky experiments
are explained by decoherence: knowing the opponent's move collapses the
superposition, while not knowing preserves it, and interference between
the "opponent cooperated" and "opponent defected" branches reduces the
cooperation probability.
\item \textbf{US political decision-making:} Voters' superposition of Republican/Democrat
preferences decoheres through exposure to campaign information.
\item \textbf{Biological applications:} The same formalism models E. coli glucose-lactose
metabolism and epigenetic evolution.
\end{itemize}

\textbf{Non-Markovian extensions} are an active frontier. The GKSL equation assumes
Markovian (memoryless) dynamics, but human cognition has strong memory effects.
Non-Markovian quantum dynamics (Nakajima-Zwanzig equations, time-convolutionless
approaches) are under development.
\section{5. Quantum Game Theory}
\label{sec:org8b8b78e}

\subsection{5.1 The EWL Protocol}
\label{sec:orgca6e979}

Eisert, Wilkens, and Lewenstein (1999) proposed the first formal framework for
quantum game theory, using entangled quantum strategies.

\textbf{Mathematical formulation:}

\begin{enumerate}
\item Classical strategies are mapped to qubit states: Cooperate = |0⟩, Defect = |1⟩.

\item An \textbf{entangling gate} creates initial correlations:
J(γ) = exp(iγ σ\textsubscript{x} ⊗ σ\textsubscript{x} / 2)
where γ ∈ [0, π/2] controls the entanglement degree and σ\textsubscript{x} is the Pauli-X
matrix.

\item The initial state is: |ψ\textsubscript{in}⟩ = J(γ)|00⟩.

\item Each player applies a unitary strategy U ∈ SU(2), parameterized as:
U(θ, φ) = [[e\textsuperscript{iφ}cos(θ/2), sin(θ/2)], [-sin(θ/2), e\textsuperscript{-iφ}cos(θ/2)]]
With I = U(0,0) = Cooperate and σ\textsubscript{x} = U(π,0) = Defect as classical strategies.

\item The final state is: |ψ\textsubscript{out}⟩ = J†(γ) · (U\textsubscript{A} ⊗ U\textsubscript{B}) · J(γ)|00⟩.

\item Payoffs are computed from measurement probabilities:
P\textsubscript{σ,τ} = |⟨σ,τ|ψ\textsubscript{out}⟩|² for σ,τ ∈ \{0,1\}
Expected payoff = Σ\textsubscript{σ,τ} P\textsubscript{σ,τ} × payoff(σ,τ).
\end{enumerate}

\textbf{Key special strategy:} Q = U(0, π/2) --- a quantum strategy with no classical
analogue. It commutes with J(γ) and has the property that Q against any classical
strategy yields at least the cooperative payoff.
