docs/research/2026-03-16_QUANTUM_MODELS_SOCIAL_ECONOMIC.tex
\subsection{7.2 Information Diffusion via Quantum Walks}
\label{sec:org83ad26e}

Quantum walks --- the quantum analog of classical random walks --- model
information propagation through social networks:

\textbf{Continuous-Time Quantum Walk Information Propagation Model (CTQW-IPM).} Ranks
crucial individuals in social networks for information spread. Overcomes
limitations of classical simulation models (extensive iteration, multiple control
parameters) by using the quantum walk's natural spreading behavior.

\textbf{Asymmetry-resolving quantum walk.} A key innovation addresses the problem that
quantum walk Hamiltonians are Hermitian (symmetric transitions), but social
influence is inherently asymmetric. The model lifts the social network state
into a higher-dimensional space and applies controlled operators to recover
asymmetric influence.

\textbf{Quantum Walk Neural Networks.} Learn a graph-dependent diffusion operation that
can \emph{direct} information flow (unlike classical random walks in GCN/DCNN that
diffuse uniformly). The "coin operators" controlling quantum walk behavior are
learned from data.

\textbf{Graph Quantum Walk Transformer (GQWformer, 2024).} Developed by Zhejiang Lab,
this architecture embeds quantum walks into graph transformers, capturing both
global and local structure. Validated on 5 benchmark datasets across biological,
chemical, and social domains, outperforming 11 baseline models.
\subsection{7.3 Voting Behavior}
\label{sec:org8c0d38a}

Quantum-like models have been applied extensively to voting:

\textbf{Nonseparability of voter preferences.} "Ticket splitting" --- voting for
different parties in executive vs. legislative races --- demonstrates non-separable
preferences that violate classical Kolmogorovian probability through inconsistent
Bayesian updating. The quantum formalism naturally accommodates this via entangled
preference states in the tensor product of the presidential and senatorial
Hilbert spaces.

\textbf{Quantum interference in political preferences.} Election contexts modeled with
quantum probability produce an interference term for contextuality. Some
reconstructed decision eigenvectors produce "hyperbolic interference" (magnitude
exceeding 1), indicating strong non-classicality.

\textbf{Coalition formation (Bagarello, 2015).} Quantum field theory formalism derives
dynamical equations for the evolution of parties' coalition preferences,
incorporating voter behavior impact.

\textbf{Quantum Condorcet Voting and Arrow's Theorem.} Quantum Condorcet Voting has
been used to disprove Arrow's Impossibility Theorem in the quantum setting. For
small readout amplitudes, quantum outcomes track the classical scheme; beyond a
modest noise level, they converge to non-classical distributions that satisfy
conditions Arrow showed to be classically impossible.

\textbf{Density operator models (Dubois).} Density operators relative to candidate
families model voting intention, with proportionality hypotheses between density
matrix coefficients and vote probabilities. Applied to the French 2012
presidential election with promising results.
\subsection{7.4 Social Choice and Contextuality}
\label{sec:org54006d5}

The deepest connection between quantum theory and social science may be through
contextuality:

\textbf{Topological connection (Baryshnikov).} "The Topology of Quantum Theory and Social
Choice" identifies topological singularities encoding the difference between
classical and quantum probability, establishing that a resolution to the social
choice problem is equivalent to a resolution to the violation of unicity in
quantum measurement frameworks.

\textbf{Contextuality-by-Default in economics (2025).} True contextuality has been found
in global investment decisions, demonstrating that quantum-like contextuality
extends beyond cognitive experiments to real-world economic behavior.

\textbf{Intransitivity and contextuality.} The relationship between intransitive
preferences (A ≻ B ≻ C ≻ A) and Type II contextuality (considered sine qua non
of quantum mechanics) has been observed in human decision-making experiments.
\section{8. Categorical and Compositional Approaches}
\label{sec:orgb585e33}

\subsection{8.1 Categorical Quantum Mechanics (CQM)}
\label{sec:org1ac5c23}

Categorical Quantum Mechanics, developed primarily by Bob Coecke, Samson Abramsky,
Chris Heunen, and Jamie Vicary at Oxford, provides the mathematical foundation
for the tensor-aware propagator network design described in the companion document.

The framework axiomatizes quantum processes in terms of:
\begin{itemize}
\item \textbf{Monoidal categories:} Sequential (∘) and parallel (⊗) composition of processes.
\item \textbf{Dagger categories:} Every process f has an adjoint f†, giving time-reversal.
\item \textbf{Compact closed categories:} Duality between objects enables wire-bending in
string diagrams, corresponding to bidirectional constraint propagation.
\item \textbf{Frobenius algebras:} Merge and copy operations at nodes, with the spider theorem
ensuring topology-independence.
\end{itemize}

The graphical calculus (string diagrams) provides a complete reasoning language:
any equation between quantum processes that holds in finite-dimensional Hilbert
spaces can be proved by diagram manipulation alone.
