docs/research/2026-03-16_QUANTUM_MODELS_SOCIAL_ECONOMIC.tex
\subsection{9.5 Survey and Polling Models}
\label{sec:orgae29d8b}

The QQ equality as a propagator constraint:

\begin{itemize}
\item The Wang-Busemeyer QQ equality is automatically satisfied by any quantum
probability model implemented on AmplitudeCells.
\item Violation detection becomes a constraint-propagation problem.
\item Order effects in survey questions are modeled by non-commutative projections.
\item The propagator network can optimize question ordering to minimize bias.
\end{itemize}
\section{10. Open Problems and Future Directions}
\label{sec:org76bf475}

\subsection{10.1 Empirical Validation Challenges}
\label{sec:orga074828}

While the QQ equality has strong empirical support (70+ national surveys), many
quantum-like models have limited validation beyond explaining known anomalies post
hoc. Prologos's modeling capabilities could help by making it easier to generate
quantitative predictions from quantum-like models and test them against data.
\subsection{10.2 The Parameter Explosion Problem}
\label{sec:org86cc8fc}

Quantum Bayesian networks suffer from exponential growth of parameters with the
number of variables. The similarity heuristic (Moreira \& Wichert) helps, but
principled dimensionality reduction for quantum-like social models remains open.
Tensor network contraction methods may provide a path.
\subsection{10.3 Non-Markovian Extensions}
\label{sec:orgde5e3aa}

The GKSL master equation assumes Markovian (memoryless) dynamics, but human
cognition has strong memory effects. Non-Markovian quantum dynamics
(Nakajima-Zwanzig equations, time-convolutionless approaches) are an active
frontier. Prologos's persistent (immutable) propagator network naturally
preserves historical states, which could be exploited for memory kernels.
\subsection{10.4 Connecting Quantum-Like to Actual Quantum Computing}
\label{sec:org8fbfdfd}

As quantum hardware matures (IBM Heron, IonQ), practical applications in finance
are demonstrating near-parity with classical methods. The question arises: can
quantum-like cognitive/social models be run on actual quantum hardware for
speedup? The answer is nuanced --- the models use quantum math but typically
involve classical simulation of small quantum systems. Quantum advantage would
emerge for large-scale social simulations (many agents, entangled beliefs).
\subsection{10.5 Contextuality as the Key Resource}
\label{sec:org03f4c3f}

The CbD framework (Dzhafarov \& Kujala) provides a theory-independent way to
detect and measure contextuality in behavioral data. Contextuality may be the
key "resource" that quantum-like models provide --- analogous to how entanglement
is a resource in quantum computing. Understanding when and why social/economic
systems are contextual would guide where quantum-like models are most valuable.
\subsection{10.6 Cross-Domain Compositional Models}
\label{sec:org2f4401a}

The categorical framework (CQM, DisCoCat) suggests the possibility of
\emph{compositional} quantum-like models that span domains: a model of voter cognition
(quantum decision theory) composed with a model of social influence (quantum
walks) composed with a model of media dynamics (open quantum systems). Prologos's
propagator network, with its natural compositional structure, is well-suited to
this vision.
\section{11. References}
\label{sec:org07ec632}

\subsection{Quantum Decision Theory}
\label{sec:org2be310c}
\begin{itemize}
\item Yukalov, V.I. \& Sornette, D. (2010). Mathematical structure of quantum decision theory. \emph{Advances in Complex Systems} 13, 659-698.
\item Yukalov, V.I. \& Sornette, D. (2011). Decision theory with prospect interference and entanglement. \emph{Theory and Decision} 70, 283-328.
\item Yukalov, V.I. \& Sornette, D. (2014). Conditions for quantum interference in cognitive sciences. \emph{Topics in Cognitive Science} 6, 79-90.
\item Yukalov, V.I. \& Sornette, D. (2016). Quantum probabilities as behavioral probabilities. \emph{Entropy} 19, 112.
\end{itemize}
\subsection{Quantum Cognition}
\label{sec:org36473e1}
\begin{itemize}
\item Busemeyer, J.R. \& Bruza, P.D. (2012). \emph{Quantum Models of Cognition and Decision}. Cambridge UP.
\item Pothos, E.M. \& Busemeyer, J.R. (2013). Can quantum probability provide a new direction for cognitive modeling? \emph{Behavioral and Brain Sciences} 36, 255-274.
\item Wang, Z. \& Busemeyer, J.R. (2013). A quantum question order model supported by empirical tests of an a priori and target prediction. \emph{Topics in Cognitive Science} 5, 689-710.
\item Wang, Z. et al. (2014). Context effects produced by question orders reveal quantum nature of human judgments. \emph{PNAS} 111, 9431-9436.
\end{itemize}
\subsection{Quantum Game Theory}
\label{sec:org849fd9c}
\begin{itemize}
\item Eisert, J., Wilkens, M. \& Lewenstein, M. (1999). Quantum games and quantum strategies. \emph{Physical Review Letters} 83, 3077.
\item Benjamin, S.C. \& Hayden, P.M. (2001). Multiplayer quantum games. \emph{Physical Review A} 64, 030301.
\item Bagarello, F. (2015). Quantum dynamics for classical systems. \emph{Springer}.
\end{itemize}
\subsection{Quantum Finance}
\label{sec:orgddb1e43}
\begin{itemize}
\item Haven, E. \& Khrennikov, A. (2013). \emph{Quantum Social Science}. Cambridge UP.
\item Haven, E. (2002). A discussion on embedding the Black-Scholes option pricing model in a quantum physics setting. \emph{Physica A} 304, 507-524.
\item Rao, A., Yang, S. \& Zakerinia, S. (2025). Using quantum game theory to model competition. \emph{SSRN}.
\end{itemize}
