docs/research/2026-03-16_QUANTUM_MODELS_SOCIAL_ECONOMIC.tex
\subsection{Open Quantum Systems in Cognition}
\label{sec:org0e8611a}
\begin{itemize}
\item Asano, M. et al. (2011). Quantum-like model of brain's functioning. \emph{Journal of Theoretical Biology} 281, 56-64.
\item Asano, M. et al. (2011). Quantum-like dynamics of decision-making. \emph{Physica A} 391, 2083-2099.
\item Khrennikov, A. (2023). Open systems, quantum probability, and logic for quantum-like modeling. \emph{Entropy} 25, 886.
\end{itemize}
\subsection{Contextuality}
\label{sec:orge5a72cb}
\begin{itemize}
\item Dzhafarov, E.N. \& Kujala, J.V. (2016). Context-content systems of random variables. \emph{Philosophical Transactions A} 374, 20150235.
\item Cervantes, V.H. \& Dzhafarov, E.N. (2018). Snow queen is evil and beautiful. \emph{Decision} 5, 193-214.
\item Baryshnikov, Y. (2022). The topology of quantum theory and social choice. \emph{Quantum Reports} 4, 14.
\end{itemize}
\subsection{Quantum Walks and Social Networks}
\label{sec:org14df466}
\begin{itemize}
\item Li, X. et al. (2022). CTQW information propagation model. \emph{Neural Computing and Applications}.
\item Dernbach, S. et al. (2019). Quantum walk neural networks. \emph{Applied Network Science}.
\end{itemize}
\subsection{Categorical and Compositional}
\label{sec:org14d4051}
\begin{itemize}
\item Coecke, B., Sadrzadeh, M. \& Clark, S. (2010). Mathematical foundations for a compositional distributional model of meaning. \emph{Linguistic Analysis} 36, 345-384.
\item Abramsky, S. \& Brandenburger, A. (2011). The sheaf-theoretic structure of non-locality and contextuality. \emph{New Journal of Physics} 13, 113036.
\end{itemize}
\subsection{Prologos Internal Documents}
\label{sec:org453a76e}
\begin{itemize}
\item Beyond Prolog: Frontiers for the Prologos Relational Language (2026-03-16).
\item Tensor-Aware Propagator Networks with Unitary Evolution (companion, 2026-03-16).
\item Logic Engine Design: Comprehensive Implementation Guide (2026-02-24).
\item Towards a General Logic Engine on Propagators (2026-02-24).
\end{itemize}
\end{document}
