docs/research/2026-03-16_QUANTUM_MODELS_SOCIAL_ECONOMIC.md


<a id="org659c15b"></a>

## Open Quantum Systems in Cognition

-   Asano, M. et al. (2011). Quantum-like model of brain's functioning. *Journal of Theoretical Biology* 281, 56-64.
-   Asano, M. et al. (2011). Quantum-like dynamics of decision-making. *Physica A* 391, 2083-2099.
-   Khrennikov, A. (2023). Open systems, quantum probability, and logic for quantum-like modeling. *Entropy* 25, 886.


<a id="orga3aef28"></a>

## Contextuality

-   Dzhafarov, E.N. & Kujala, J.V. (2016). Context-content systems of random variables. *Philosophical Transactions A* 374, 20150235.
-   Cervantes, V.H. & Dzhafarov, E.N. (2018). Snow queen is evil and beautiful. *Decision* 5, 193-214.
-   Baryshnikov, Y. (2022). The topology of quantum theory and social choice. *Quantum Reports* 4, 14.


<a id="org13e0a7e"></a>

## Quantum Walks and Social Networks

-   Li, X. et al. (2022). CTQW information propagation model. *Neural Computing and Applications*.
-   Dernbach, S. et al. (2019). Quantum walk neural networks. *Applied Network Science*.


<a id="orgddec220"></a>

## Categorical and Compositional

-   Coecke, B., Sadrzadeh, M. & Clark, S. (2010). Mathematical foundations for a compositional distributional model of meaning. *Linguistic Analysis* 36, 345-384.
-   Abramsky, S. & Brandenburger, A. (2011). The sheaf-theoretic structure of non-locality and contextuality. *New Journal of Physics* 13, 113036.


<a id="org2c1b28e"></a>

## Prologos Internal Documents

-   Beyond Prolog: Frontiers for the Prologos Relational Language (2026-03-16).
-   Tensor-Aware Propagator Networks with Unitary Evolution (companion, 2026-03-16).
-   Logic Engine Design: Comprehensive Implementation Guide (2026-02-24).
-   Towards a General Logic Engine on Propagators (2026-02-24).
